================================================================================
Meta
================================================================================

<"foo":"bar", 1:"baz">1

--------------------------------------------------------------------------------

(document
  (meta
    (mpair
      (string
        (string_content))
      (string
        (string_content)))
    (mpair
      (number)
      (string
        (string_content))))
  (number)
)

=================================================================================
Arrays
================================================================================

[
  345,
  10.1,
  10,
  -10,
  null,
  true,
  false,
  { "stuff": "good" },
  i{ 1: 2 }
]

--------------------------------------------------------------------------------

(document
  (array
    (number)
    (number)
    (number)
    (number)
    (null)
    (true)
    (false)
    (map
      (pair
        (string
          (string_content))
        (string
          (string_content))))
    (imap
      (ipair
        (number)
        (number)))
    ))

=================================================================================
Arrays with superfluous ',' after last element
================================================================================

[
  34,
  10,
]

--------------------------------------------------------------------------------

(document
  (array
    (number)
    (number)
    ))

================================================================================
String content
================================================================================

[
  "",
  "abc",
  "def\n",
  "ghi\t",
  "jkl\f"
]

--------------------------------------------------------------------------------

(document
  (array
    (string)
    (string
      (string_content))
    (string
      (string_content
        (escape_sequence)))
    (string
      (string_content
        (escape_sequence)))
    (string
      (string_content
        (escape_sequence)))))

================================================================================
Top-level numbers
================================================================================

-1

--------------------------------------------------------------------------------

(document
  (number))

================================================================================
Top-level null
================================================================================

null

--------------------------------------------------------------------------------

(document
  (null))

================================================================================
Comments
================================================================================

{
  "a": 1,
  
  // we allow comments, because several
  // commonly used tools allow comments in
  // files with the extension `.cpon`
  "b": "2",

  /*
   * Block comments are also ok
   */
  "c": 3
}

--------------------------------------------------------------------------------

(document
  (map
    (pair
      (string
        (string_content))
      (number))
    (comment)
    (comment)
    (comment)
    (pair
      (string
        (string_content))
      (string
        (string_content)))
    (comment)
    (pair
      (string
        (string_content))
      (number))))
